// ページネーション設定
export const ITEMS_PER_PAGE = 20;

// サービスエリア（都道府県コード）// SearchForm.tsxでしか使わないが、今後の変更に備えてconstants.tsに移動
export const SERVICE_AREAS: Record<string, Record<string, string>> = {
  "北海道・東北": {
    北海道: "SA41",
    青森: "SA51",
    岩手: "SA52",
    宮城: "SA53",
    秋田: "SA54",
    山形: "SA55",
    福島: "SA56",
  },
  関東: {
    東京: "SA11",
    神奈川: "SA12",
    埼玉: "SA13",
    千葉: "SA14",
    茨城: "SA15",
    栃木: "SA16",
    群馬: "SA17",
  },
  "北陸・甲信越": {
    新潟: "SA61",
    富山: "SA62",
    石川: "SA63",
    福井: "SA64",
    山梨: "SA65",
    長野: "SA66",
  },
  中部: {
    岐阜: "SA31",
    静岡: "SA32",
    愛知: "SA33",
    三重: "SA34",
  },
  関西: {
    滋賀: "SA21",
    京都: "SA22",
    大阪: "SA23",
    兵庫: "SA24",
    奈良: "SA25",
    和歌山: "SA26",
  },
  中国: {
    鳥取: "SA71",
    島根: "SA72",
    岡山: "SA73",
    広島: "SA74",
    山口: "SA75",
  },
  四国: {
    徳島: "SA81",
    香川: "SA82",
    愛媛: "SA83",
    高知: "SA84",
  },
  "九州・沖縄": {
    福岡: "SA91",
    佐賀: "SA92",
    長崎: "SA93",
    熊本: "SA94",
    大分: "SA95",
    宮崎: "SA96",
    鹿児島: "SA97",
    沖縄: "SA98",
  },
};
